name: "gr_trt"
platform: "tensorrt_plan"
max_batch_size: 8
input [
  { name: "pair_in", data_type: TYPE_FP32, dims: [ -1, -1 ] }
]
output [
  { name: "scores", data_type: TYPE_FP32, dims: [ -1 ] }
]
instance_group [{ kind: KIND_GPU, count: 1 }]
parameters {
  key: "serialized_file" value: { string_value: "model.engine" }
}
